# Задача 0
# Дан список чисел, заменить каждое число на квадрат этого числа.
# 	[1, 2, 3, 4] -> [1, 4, 9, 16]


numbers = [1, 2, 3, 4]
for i in numbers:
    print(i ** 2)
